-- assume need logic.lua before this file

lang = 
{
	{1, '盖伦', '4法力:击杀资源不大于4的敌方目标盟军'}
,	{2, '瑞雯', '3法力:你使用的武器+2基础攻击力(不能叠加，并取消其他攻击力加成)'}
,	{3, '惩戒之箭', '4法力:目标敌方盟军的生命值降至1，返还1张墓地顶端的猎人牌到手牌'}
,	{4, '寒冰射手', '3法力:你的目标武器+2耐久度，下回合结束前+2攻击力'}
,	{5, '宙斯', '5法力:全体盟军受到4点闪电伤害'}
,	{6, '水晶室女', '4法力:目标敌方盟军受到4点寒冰伤害且2个回合内冰封（不能攻击、反击或使用技能）2个回合'}
,	{7, '全能骑士', '4法力:移除目标友方英雄或盟军所有的负面效果和敌方附加牌，或单独移除目标附加牌'}
,	{8, '琴女', '3法力:治疗目标友方英雄或盟军3点伤害'}
,	{9, '暮光之眼', '4法力:目标友方盟军具1回合内突袭，潜行和迅捷'}
,	{10, '不详之刃', '3法力:你的回合结束前，武器+2攻击力，对英雄造成战斗伤害后随机弃置一张手牌'}
,	{11, '巨魔之王', '4法力:撤退一个盟军或破坏目标支援技能、武器、防具、神器或陷阱'}
--,	{11, '巨魔之王', '3法力:移除目标支援技能、武器、防具、神器或陷阱'}
,	{12, '诺克萨斯之手', '4法力:你的回合结束前，武器+1攻击力，受到他战斗伤害的盟军死亡'}
,	{13, '骷髅射手', '3法力:造成2个以内不同目标英雄或盟军2点伤害（无视盟军或者防具技能防御）'}
,	{14, '邪眼猎人', '4法力：你手牌目标的武器出场时不消耗资源且+1基础攻击力'}
,	{15, '安妮', '4法力：目标敌方盟军受到3点火焰伤害，抽一张牌'}
,	{16, '遗忘法师', '4法力：复活你坟墓里的目标盟军到场上'}
,	{17, '嗜血猎手', '3法力：你的下个回合开始前，武器+2攻击力，伏击（攻击后不会被反击）'}
,	{18, '嗜血猎手-沃里克', '3法力：你的下回合开始前，他和友方盟军潜行（不会被攻击）'}
,	{19, '测试英雄1', '法力1:全部英雄受到1点伤害'}
,	{20, '测试英雄2', '法力2:目标英雄受到1点火伤害'}
-- ,	{19, '冰晶凤凰-艾尼维亚', '3法力：目标友方盟军+1基础攻击力和+3生命'}
-- ,	{20, '远古巫灵-泽拉斯', '3法力：目标2个以内不同的敌方英雄或盟军受到3点闪电伤害'}
,	{21, '狂野女猎手', '2资源：目标敌方盟军不能攻击，直到该盟军主人下回合结束'}
,	{22, '刀锋之影', '伏击（攻击后不会被反击）'}
,	{23, '九尾妖狐', '如果敌方的资源最大值不小于你，她出战时敌方资源最大值-1'}
,	{24, '堕落天使', '出战时返还坟墓最顶端的支援牌（不含支援技能）到手牌'}
,	{25, '恶魔小丑', '迅捷（出战回合即可进行攻击或使用技能）'}
,	{26, '狂战士', ''}
,	{27, '波比', '守护者（非守护者盟军不能被选定为目标）'}
,	{28, '德邦总管', '受到的技能伤害-1，如果场上的友方盟军数量大于等于3则+1攻击力'}
,	{29, '暗影之拳', '潜行（此盟军不会被攻击）'}
,	{30, '无双剑姬', ''}
,	{31, '荆棘之兴', '盟军受到她的战斗伤害后基础攻击力减至0'}
,	{32, '皇子', '你的回合内，他在场时友方盟军+1攻击力'}
,	{33, '放逐之刃', '2资源：你使用的武器+1耐久度'}
,	{34, '曙光女神', '1资源：目标友方盟军+2生命（该盟军在场时此技能不可再用）'}
,	{35, '审判天使', '审判天使出场时，敌方英雄-1法力，友方英雄+1生命'}
,	{36, '披甲龙龟', '受到的伤害-2'}
,	{37, '扭曲树精', '1法力：目标敌方盟军的基础攻击减至0'}
,	{38, '策士统领', '他被杀时，抽2张牌'}
,	{39, '熔岩巨兽', '以自己的生命使友方盟军被杀后复活并+2基础攻击力和+2生命'}
,	{40, '潘森', '守护者；3资源：目标其他友方盟军+1基础攻击力和+1生命值'}
,	{41, '爆破鬼才', '击杀他的英雄或盟军受到2点伤害'}
,	{42, '骷髅王', '2资源：1回合内+2攻击力'}
,	{43, '石像鬼', '受到的伤害-1'}
,	{44, '掘墓者', ''}
,	{45, '魂锁典狱长', '3资源：目标敌方英雄或盟军受到4点伤害'}
,	{46, '荒漠屠夫', '1资源：1回合内+3攻击力并-3生命'}
,	{47, '潮汐海灵', ''}
,	{48, '诡术妖姬', '出场时抽一张牌'}
,	{49, '血狼', '每回合开始时治疗自己1点伤害'}
,	{50, '魔蛇之拥', '1资源：目标敌方盟军1回合内不能反击'}
,	{51, '地狱马', '首位其他友方盟军在自己的回合内攻击造成的伤害+1'}
,	{52, '虚空行者', '先手反击（受到攻击时会先于攻击者进行攻击）'}
,	{53, '死灵法师', '出战时敌方英雄受到1点伤害; 0资源：目标敌方英雄或盟军受到2点伤害'}
,	{54, '殇之木乃伊', '每杀死1个盟军+1基础攻击力和+1生命'}
,	{55, '影流之主', '出场时坟墓顶端的首张盟军牌返回手牌'}
,	{56, '炼金术士', '先手反击；受到炼金术士伤害的盟军会中毒（每回合受到1点毒性伤害）；1法力：目标敌方盟军受到1点伤害'}
,	{57, '龙血武姬', '伤害她的英雄或盟军受到1点火焰伤害；与她战斗的盟军自燃（每回合受到1点火焰伤害）'}
,	{58, '野蛮牛头人', '死亡时对它的英雄造成2点伤害'}
,	{59, '循迹之狼', '造成战斗伤害时，抽一张牌。'}
,	{60, '虚空恐惧', '每个盟军死亡时，它+1基础攻击力和+1生命值；3资源：目标资源小于它攻击力的盟军死亡'}
,	{61, '曲光屏障', '友方盟军2回合内不会受到攻击'}
,	{62, '备用武器', '在场时，你的武器+1攻击力；摧毁它，使你坟墓内的目标武器返回场上并+1基础攻击力'}
,	{63, '战旗', '在场时全体友方盟军+1攻击力'}
,	{64, '粉碎打击', '破坏目标敌方武器或防具'}
,	{65, '强化生命', '附加英雄+10生命'}
,	{66, '战士训练', '被它附加的友方盟军成为守护者（非守护者盟军不能被选定为目标）'}
,	{67, '虚弱', '附加敌方盟军的攻击力变为0'}
,	{68, '死灵狂暴', '你的英雄被附加后，敌方盟军死亡时治疗你英雄2点伤害'}
,	{69, '破晓之盾', '目标敌方盟军受到3点伤害'}
,	{70, '狂战之怒', '附加你的英雄后，你的回合开始时英雄受到1点伤害，多抽1张牌'}
,	{71, '火球术', '目标敌方英雄或盟军受到4点火焰伤害'}
,	{72, '冰封陵墓', '目标敌方盟军3个回合内冰封（不能攻击、反击或使用技能）'}
,	{73, '死亡毒气', '目标敌方英雄或盟军中毒（每回合开始时受到1点毒性伤害）'}
,	{74, '闪电脉冲', '目标2个以内不同的敌方英雄或盟军受到3点闪电伤害'}
,	{75, '烈火燃烧', '目标英雄或盟军自燃（每回合开始时受到1点火焰伤害）'}
,	{76, '卡牌骗术', '2资源：抽1张牌'}
,	{77, '野性奔腾', '你3个回合内出战的盟军迅捷（出战回合即可进行攻击或使用技能）'}
,	{78, '烈焰之柱', '所有英雄和盟军受到5点火焰伤害'}
,	{79, '奥术弹幕', '目标4个以内不同的敌方英雄或盟军受到2点奥术伤害'}
,	{80, '结茧', '目标敌方盟军2个回合内残废（不能攻击、反击和使用技能）'}
,	{81, '强击光环', '附加在你的弓上，使其+1攻击力'}
,	{82, '毒性射击', '目标敌方盟军中毒，1回合内残废'}
,	{83, '火箭', '目标敌方盟军受到2点火焰伤害（不能被盟军或防具技能降低）并自燃'}
,	{84, '快速射击', '附加在你的英雄后，每回合可以攻击2次'}
,	{85, '死亡陷阱', '牌面朝下拖放此牌，令敌方下一个出战的盟军死亡'}
,	{86, '隐匿森林', '附加在你的英雄后，1回合内英雄隐匿（他和他的附加牌不能成为目标）'}
,	{87, '作战计划', '在场时你可观看自己牌堆的第一张牌；1资源：移动牌堆顶的牌到牌堆底'}
,	{88, '奇袭', '附加奇袭的目标友方盟军伏击，并在造成战斗伤害后抽1张牌'}
,	{89, '网兜陷阱', '牌面朝下拖放此牌，令敌方下一名出战的盟军3回合内残废（不能攻击、反击和使用技能）'}
,	{90, '追踪者', '在场时你可以观看敌方玩家的手牌'}
,	{91, '神圣治疗', '治疗目标友方英雄或盟军4点伤害并移除其负面效果与敌方附加牌'}
,	{92, '月之祝福', '被它附加的友方盟军+2攻击力'}
,	{93, '怒涛之啸', '所有盟军死亡'}
,	{94, '寒冰碎片', '敌方全体盟军受到2点寒冰伤害'}
,	{95, '黑暗祭祀', '破坏目标敌方的支援牌'}
,	{96, '重生', '你坟墓里的所有盟军复活回到牌堆顶端'}
,	{97, '神圣庇护', '附加在目标友方英雄或盟军，令其1回合内免受伤害且不会死亡。'}
,	{98, '瘟疫', '自己-1资源，令敌方玩家-2资源（至少剩余2）'}
,	{99, '奥术重击', '目标敌方英雄或盟军受到3点奥术伤害'}
,	{100, '诅咒之书', '敌方全体盟军-1攻击力'}
,	{101, '背刺', '指定一名可行动的友方盟军，令其杀死目标敌方盟军'}
,	{102, '鹰击长空', '观看目标敌人的手牌；抽1张牌；该回合内友方盟军+1攻击力'}
,	{103, '小莫飞刀', '伏击（攻击后不会被反击）'}
,	{104, '死亡毒液', '附加在你的目标武器后，受到该武器伤害的英雄或盟军会中毒'}
,	{105, '枪火谈判', '破坏目标敌方支援牌（不含支援技能），你的资源+1'}
,	{106, '暗影突袭', '0资源：你的下回合结束前，友方盟军伏击（攻击后不会被反击）'}
,	{107, '不义之财', '敌方盟军死亡或物品被破坏时，抽1张牌'}
,	{108, '隐形翅膀', '你的下回合结束前，友方英雄和盟军隐匿（他和他的附加牌不能成为目标）但不能攻击'}
,	{109, '木乃伊之咒', '目标敌方盟军1回合内残废（不能攻击、反击和使用技能）；抽1张牌'}
,	{110, '深夜幽影', '伏击（攻击后不会被反击）；隐匿（他和他的附加牌不能成为目标）'}
,	{111, '无尽束缚', '附加的目标敌方盟军残废（不能攻击、反击和使用技能）'}
,	{112, '群狼', '每有1名其他友方群狼在场，此群狼+1攻击力'}
,	{113, '鬼影重重', '目标资源不高于3的敌方盟军死亡'}
,	{114, '迅击', '附加你的英雄后，每回合可以攻击2次'}
,	{115, '巨齿', ''}
,	{116, '再生', '治疗你的英雄4点伤害并移除敌方附加牌和负面效果'}
,	{117, '满月', '你下回合开始前，友方盟军+2攻击力且你的英雄不受伤害'}
,	{118, '狂犬之啮', '目标敌方有攻击能力的盟军随机攻击敌方英雄或盟军，攻击后1回合内残废'}
,	{119, '独狼', '附加你的英雄且没有友方盟军在场，你每回合开始时英雄治疗2点伤害'}
,	{120, '狼甲', '附加友方狼人盟军后+2攻击力和+3生命，狼甲被摧毁后你的盟军+1生命'}
,	{121, '能量喷射', '目标友方可受伤害的盟军死亡，所有敌方盟军死亡，你的英雄受到5点伤害'}
,	{122, '能量转化', '目标友方可受伤害的盟军死亡，治疗你的英雄的相当于该盟军生命值的伤害'}
,	{123, '刈魂', '移除你坟墓里所有盟军，每个盟军使你英雄治疗2点伤害'}
,	{124, '魂火', '每个在场的其他魂火令其+1攻击力和+1生命'}
,	{125, '迁移', '从目标敌方牌堆抽1张牌'}
,	{126, '精神掌控', '令目标敌方可进行攻击的盟军攻击它的英雄，该盟军死亡'}
,	{127, '刷新', '恢复所有你已使用的资源'}
,	{128, '能量碎片', '你的盟军+2攻击力，最大生命值变为1'}
,	{129, '星之祝福', '被它附加的目标友方盟军+5生命'}
,	{130, '无尽轮回', '转移坟墓的牌至牌堆，该牌消失'}
,	{131, '月之暗面', '友方盟军2个回合内潜行（不会被攻击）'}
,	{132, '撤退', '目标盟军回到他主人的手牌'}
,	{133, '强化盔甲', '被它附加的目标友方盟军受到伤害-1'}
,	{134, '定时炸弹', '目标敌方英雄或盟军受到3点伤害'}
,	{135, '祈愿', '治疗全体友方盟军2点伤害，抽1张牌'}
,	{136, '正义加持', '你的回合开始时，治疗全体友方盟军2点伤害；0资源：摧毁目标“邪恶加持”'}
,	{137, '光芒四射', '目标敌方英雄-2法力'}
,	{138, '弱者散退', '目标敌方资源不大于4的支援牌回到手牌'}
,	{139, '装备风化', '附加目标敌方武器或防具，-1攻击力或防御力，战斗使用时额外-1耐久度'}
,	{140, '安魂曲', '如果你坟墓里盟军数量不少于3，抽2张牌且英雄+2生命'}
,	{141, '嗜血杀戮', '你本回合结束前全体友方盟军+2攻击力'}
,	{142, '召唤虚灵', '抽1张牌，资源不小于你的敌方玩家-1资源'}
,	{143, '法力损毁', '所有英雄的法力变为0且受到2点伤害'}
,	{144, '野性尖叫', '摧毁目标敌方不大于4资源的支援牌，你的资源-1'}
,	{145, '邪恶加持', '你的每回合开始时，所有盟军受到1点伤害；0资源：破坏目标正义加持'}
,	{146, '血石祭坛', '受伤的友方盟军+1攻击力'}
,	{147, '恐惧', '目标敌方盟军失去守护者和先手反击能力且不能被他的主人选定为目标'}
,	{148, '酸液', '目标敌方武器或防具-3耐久度'}
,	{149, '法力源泉', '你的英雄获得3点法力'}
,	{150, '魅惑妖术', '目标能受伤害的友方盟军死亡，抽相当于该盟军资源的牌（不超过3张）'}
,	{151, '暴雨', '你下回合结束前所有盟军不能进行攻击'}
,	{152, '法力流失', '目标敌方英雄-1法力且在你下回合开始前不能发动英雄技能'}
,	{153, '无言恐惧', '你下回合结束前所有英雄不能进行攻击'}
,	{154, '血之狂暴', '你下回合开始前，被它附加的目标友方盟军+2攻击力'}
,	{155, '商店', '每回合开始时，每个玩家多抽1张牌'}
,	{156, '切断联系', '摧毁目标附加牌'}
,	{157, '圣诞糖果棒', '每个玩家抽3张牌'}
,	{158, '铁匠术', '你坟墓里的目标武器或防具回到你的手牌'}
,	{159, '熔化', '摧毁你的目标支援武器、防具、神器、陷阱，抽2张牌'}
,	{160, '破坏射线', '摧毁目标敌方不低于5资源的支援牌（不含支援技能），抽1张牌'}
,	{161, '新星铠甲', '你的回合开始时，你的英雄移除所有敌方附加和负面效果，受到1点火焰伤害'}
,	{162, '冰川护甲', '英雄或盟军攻击你的英雄后会被冰封1个回合'}
,	{163, '雷暴护甲', '攻击你英雄的英雄或盟军会受到1点闪电伤害'}
,	{164, '永恒铠甲', '你的英雄不能攻击或反击'}
,	{165, '王者铠甲', '友方盟军+2攻击力、+1生命值'}
,	{166, '夜行衣', '你的英雄对敌方英雄造成战斗伤害时，随机获得该敌方玩家的1张手牌'}
,	{167, '丛林护甲', '友方盟军被杀时，抽1张牌'}
,	{168, '血之铠甲', '敌方盟军被杀时，你的英雄治疗2点伤害'}
,	{169, '盗墓者斗篷', '2法力：从目标敌方玩家的坟墓抽1张牌到你的手牌'}
,	{170, '蛇皮战衣', '出场时所有玩家-1资源最大值，你抽1张牌'}
,	{171, '荆棘之甲', '对你的英雄造成伤害的盟军死亡'}
,	{172, '法力护盾', '攻击你英雄的盟军-1攻击力'}
,	{173, '板甲', '1法力：目标友方盟军+1生命'}
,	{174, '月光护腕', '月光护腕被摧毁时，你使用的武器+1耐久度'}
,	{175, '嘲讽甲胄', '你的英雄成为守护者（非守护者盟军不能被选定为目标）'}
,	{176, '流浪法师斗篷', '友方盟军受到的技能伤害-2'}
,	{177, '灵风魔袍', '你的英雄受到伤害时，抽1张牌'}
,	{178, '暗影铠甲', '敌方盟军死亡时，你的英雄+1法力同时受到2点伤害'}
,	{179, '黑暗法袍', '你每回合开始时+1防御力；当防御力达到5，在你回合结束时自我摧毁令敌方所有盟军死亡'}
,	{180, '破法护腕', '你的英雄不会受到技能伤害'}
,	{181, '哀悼之锋', '盟军死亡时+1攻击力（最大值为5）'}
,	{182, '裂空刀', '你的英雄造成战斗伤害时，交战双方从对方牌堆抽1张牌'}
,	{183, '神秘之剑', '造成战斗伤害时+1攻击力'}
,	{184, '贪婪之刃', '你的英雄攻击时，恢复2点已使用的资源'}
,	{185, '勾魂猎弓', '当你的英雄杀死一名盟军时,自身治疗3点伤害'}
,	{186, '瞬发长弓', '你的英雄可获得先手反击效果,当反击时额外+1伤害'}
,	{188, '老头剑', '出场时你的英雄受到1点伤害'}
,	{189, '烈焰法杖', '1法力:目标敌方盟军受到1点火焰伤害并自燃'}
,	{190, '冰晶节杖', '出场的盟军2个回合内冰封'}
,	{191, '木杖', '你的英雄不能主动攻击但是可以反击'}
,	{192, '暗影碎片', '出场时你的英雄-1法力'}
,	{193, '多兰法杖', '1法力:抽1张牌'}
,	{194, '黄金拳剑', '你的英雄反击时，它不损失耐久度'}
,	{195, '回魂法杖', '你的英雄在战斗中伤害其他英雄时，你坟墓顶端的盟军以1生命状态回到场上'}
,	{196, '多兰之刃', '反击时+1伤害'}
,	{197, '麦瑞德之爪', '造成的战斗伤害无视对方防具'}
,	{198, '碎踝鞭', '受到你英雄战斗伤害的盟军-1基础攻击力且残废1回合'}
,	{200, '撤退匕首', '受到你英雄非致命战斗伤害的盟军退回手牌'}


};

job_map = {
	[1] = '战士',  	-- warrior, boris etc
	[2] = '猎人',	-- hunter, victor etc
	[4] = '法师',	-- mage, nishaven etc
	[8] = '牧师',	-- priest, zhanna etc
	[16] = '刺客',	-- rogue
	[32] = '狼人',	-- wulven
	[64] = '元素师',	-- elemental
	[128] = 'x_x',	--  unknown
	[256] = '人类',  -- human  (this is camp)
	[512] = '暗影',		-- shadow
	[999] = 'j_j',
};

g_card_list = g_card_list or {};

-- job id to name
function job_id_name(job)
	local jname = '';
	local binary={512,256,128,64,32,16,8,4,2,1};
	for i=1,#binary do
		if job >= binary[i] then
			job = job - binary[i];
			jname = jname .. '[' .. job_map[binary[i]] .. ']';
		end
	end
	return jname;
end

function init_lang()
	local index = 1;
	if g_card_list == nil or hero_list==nil then
		return -1, "g_card_list err";
	end
	for i=1, #lang do
		local entry = lang[index];
		local id = entry[1];
		local name = entry[2];
		local skill_desc = entry[3];
		local cc;
		
		if id >= 21 then 
			cc = g_card_list[id];
		else
			cc = hero_list[id];
		end

		if cc ~= nil then
			cc.name = name;
			cc.skill_desc = skill_desc;
			cc.job_name = job_id_name(cc.job);
		end

		index = index + 1;

	end
end

init_lang();


